wrkAndProfile/stage2/wrk2_runAndResults_GET.txt
wrk -t4 -c100 -d10m -R6000 -s wrkAndProfile/scripts/get.lua --latency http://127.0.0.1:8080
Running 10m test @ http://127.0.0.1:8080
  4 threads and 100 connections
  Thread calibration: mean lat.: 3914.509ms, rate sampling interval: 12820ms
  Thread calibration: mean lat.: 3962.389ms, rate sampling interval: 12951ms
  Thread calibration: mean lat.: 3975.890ms, rate sampling interval: 12984ms
  Thread calibration: mean lat.: 3966.248ms, rate sampling interval: 12943ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.37m     1.90m    7.64m    57.94%
    Req/Sec   499.49     14.02   545.00     74.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.35m 
 75.000%    5.01m 
 90.000%    6.00m 
 99.000%    6.67m 
 99.900%    7.29m 
 99.990%    7.55m 
 99.999%    7.64m 
100.000%    7.65m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6877.183     0.000000            1         1.00
   46989.311     0.100000       118005         1.11
   85065.727     0.200000       236089         1.25
  121307.135     0.300000       353990         1.43
  160563.199     0.400000       471893         1.67
  200802.303     0.500000       589865         2.00
  221118.463     0.550000       649200         2.22
  241303.551     0.600000       708087         2.50
  261226.495     0.650000       766904         2.86
  281018.367     0.700000       826263         3.33
  300417.023     0.750000       884788         4.00
  310640.639     0.775000       914895         4.44
  320602.111     0.800000       944442         5.00
  330301.439     0.825000       973776         5.71
  340000.767     0.850000      1002969         6.67
  349962.239     0.875000      1032375         8.00
  354942.975     0.887500      1047271         8.89
  359923.711     0.900000      1062197        10.00
  364904.447     0.912500      1077165        11.43
  369623.039     0.925000      1091503        13.33
  374603.775     0.937500      1106408        16.00
  376963.071     0.943750      1113598        17.78
  379322.367     0.950000      1120770        20.00
  381681.663     0.956250      1128014        22.86
  384303.103     0.962500      1135843        26.67
  386662.399     0.968750      1143035        32.00
  387973.119     0.971875      1146935        35.56
  389283.839     0.975000      1150741        40.00
  390332.415     0.978125      1153966        45.71
  391643.135     0.981250      1157851        53.33
  392953.855     0.984375      1161802        64.00
  393478.143     0.985938      1163340        71.11
  394264.575     0.987500      1165183        80.00
  397672.447     0.989062      1166823        91.43
  401866.751     0.990625      1168645       106.67
  406585.343     0.992188      1170510       128.00
  408944.639     0.992969      1171378       142.22
  411566.079     0.993750      1172289       160.00
  414187.519     0.994531      1173213       182.86
  416808.959     0.995313      1174113       213.33
  419692.543     0.996094      1175045       256.00
  421789.695     0.996484      1175520       284.44
  423886.847     0.996875      1175941       320.00
  426246.143     0.997266      1176428       365.71
  428605.439     0.997656      1176898       426.67
  430964.735     0.998047      1177331       512.00
  432275.455     0.998242      1177569       568.89
  433324.031     0.998437      1177782       640.00
  434634.751     0.998633      1178037       731.43
  435945.471     0.998828      1178267       853.33
  437518.335     0.999023      1178496      1024.00
  438304.767     0.999121      1178614      1137.78
  439091.199     0.999219      1178730      1280.00
  439877.631     0.999316      1178835      1462.86
  440664.063     0.999414      1178944      1706.67
  441450.495     0.999512      1179045      2048.00
  441974.783     0.999561      1179110      2275.56
  442761.215     0.999609      1179176      2560.00
  443547.647     0.999658      1179221      2925.71
  444858.367     0.999707      1179282      3413.33
  446169.087     0.999756      1179344      4096.00
  446693.375     0.999780      1179368      4551.11
  447479.807     0.999805      1179392      5120.00
  448528.383     0.999829      1179421      5851.43
  449839.103     0.999854      1179448      6826.67
  451674.111     0.999878      1179477      8192.00
  452722.687     0.999890      1179494      9102.22
  453509.119     0.999902      1179505     10240.00
  454557.695     0.999915      1179521     11702.86
  455344.127     0.999927      1179537     13653.33
  456392.703     0.999939      1179552     16384.00
  456654.847     0.999945      1179560     18204.44
  456916.991     0.999951      1179568     20480.00
  457179.135     0.999957      1179576     23405.71
  457441.279     0.999963      1179585     27306.67
  457441.279     0.999969      1179585     32768.00
  457703.423     0.999973      1179589     36408.89
  457965.567     0.999976      1179597     40960.00
  457965.567     0.999979      1179597     46811.43
  458227.711     0.999982      1179607     54613.33
  458227.711     0.999985      1179607     65536.00
  458227.711     0.999986      1179607     72817.78
  458227.711     0.999988      1179607     81920.00
  458489.855     0.999989      1179613     93622.86
  458489.855     0.999991      1179613    109226.67
  458489.855     0.999992      1179613    131072.00
  458489.855     0.999993      1179613    145635.56
  458489.855     0.999994      1179613    163840.00
  458751.999     0.999995      1179620    187245.71
  458751.999     1.000000      1179620          inf
#[Mean    =   202161.467, StdDeviation   =   113707.072]
#[Max     =   458489.856, Total count    =      1179620]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1197590 requests in 10.00m, 77.66MB read
Requests/sec:   1995.98
Transfer/sec:    132.55KB