wrkAndProfile/stage2/wrk2_runAndResults_GET.txt
wrk -t16 -c100 -d10m -R4000 -s /home/valaubr/GitDirs/2020-highload-dht/src/test/wrkAndProfile/scripts/get.lua --latency http://127.0.0.1:8080
Running 10m test @ http://127.0.0.1:8080
  16 threads and 100 connections
  Thread calibration: mean lat.: 3124.694ms, rate sampling interval: 9625ms
  Thread calibration: mean lat.: 3118.685ms, rate sampling interval: 9609ms
  Thread calibration: mean lat.: 3179.999ms, rate sampling interval: 9814ms
  Thread calibration: mean lat.: 3019.898ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 3209.402ms, rate sampling interval: 9904ms
  Thread calibration: mean lat.: 3028.406ms, rate sampling interval: 9469ms
  Thread calibration: mean lat.: 3096.921ms, rate sampling interval: 9412ms
  Thread calibration: mean lat.: 3029.066ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 3160.304ms, rate sampling interval: 9732ms
  Thread calibration: mean lat.: 2983.340ms, rate sampling interval: 9207ms
  Thread calibration: mean lat.: 3205.020ms, rate sampling interval: 9830ms
  Thread calibration: mean lat.: 3113.814ms, rate sampling interval: 9592ms
  Thread calibration: mean lat.: 3158.978ms, rate sampling interval: 9715ms
  Thread calibration: mean lat.: 3137.475ms, rate sampling interval: 9601ms
  Thread calibration: mean lat.: 2977.140ms, rate sampling interval: 9158ms
  Thread calibration: mean lat.: 3015.210ms, rate sampling interval: 9306ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.31m     1.25m    5.48m    58.89%
    Req/Sec   138.98      8.02   153.00     87.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.32m 
 75.000%    3.35m 
 90.000%    3.97m 
 99.000%    4.69m 
 99.900%    5.10m 
 99.990%    5.38m 
 99.999%    5.47m 
100.000%    5.49m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4812.799     0.000000            6         1.00
   34504.703     0.100000       131737         1.11
   61112.319     0.200000       263280         1.25
   87162.879     0.300000       394849         1.43
  113180.671     0.400000       526563         1.67
  139329.535     0.500000       658430         2.00
  152174.591     0.550000       723934         2.22
  164757.503     0.600000       789762         2.50
  177340.415     0.650000       855630         2.86
  189399.039     0.700000       921356         3.33
  201195.519     0.750000       987641         4.00
  208142.335     0.775000      1020266         4.44
  214040.575     0.800000      1052865         5.00
  220200.959     0.825000      1085716         5.71
  225968.127     0.850000      1118797         6.67
  231866.367     0.875000      1151770         8.00
  235012.095     0.887500      1168059         8.89
  238419.967     0.900000      1184819        10.00
  241696.767     0.912500      1201131        11.43
  244973.567     0.925000      1217762        13.33
  249823.231     0.937500      1233961        16.00
  252444.671     0.943750      1242079        17.78
  255066.111     0.950000      1250234        20.00
  257949.695     0.956250      1258682        22.86
  260702.207     0.962500      1266783        26.67
  264765.439     0.968750      1274911        32.00
  266993.663     0.971875      1279029        35.56
  269221.887     0.975000      1283340        40.00
  271319.039     0.978125      1287243        45.71
  274202.623     0.981250      1291478        53.33
  276824.063     0.984375      1295818        64.00
  278134.783     0.985938      1297700        71.11
  279445.503     0.987500      1299861        80.00
  280756.223     0.989062      1301948        91.43
  282066.943     0.990625      1303909       106.67
  283377.663     0.992188      1305979       128.00
  284164.095     0.992969      1307111       142.22
  284688.383     0.993750      1307939       160.00
  285474.815     0.994531      1308859       182.86
  286523.391     0.995313      1309867       213.33
  289144.831     0.996094      1310911       256.00
  290717.695     0.996484      1311423       284.44
  292552.703     0.996875      1311948       320.00
  294387.711     0.997266      1312472       365.71
  296484.863     0.997656      1312979       426.67
  298844.159     0.998047      1313477       512.00
  300154.879     0.998242      1313702       568.89
  301465.599     0.998437      1313990       640.00
  303038.463     0.998633      1314232       731.43
  304873.471     0.998828      1314495       853.33
  306446.335     0.999023      1314762      1024.00
  307232.767     0.999121      1314896      1137.78
  308019.199     0.999219      1315006      1280.00
  309067.775     0.999316      1315135      1462.86
  310116.351     0.999414      1315264      1706.67
  311427.071     0.999512      1315373      2048.00
  312213.503     0.999561      1315440      2275.56
  312999.935     0.999609      1315501      2560.00
  313786.367     0.999658      1315567      2925.71
  314572.799     0.999707      1315629      3413.33
  315621.375     0.999756      1315700      4096.00
  316145.663     0.999780      1315730      4551.11
  316669.951     0.999805      1315756      5120.00
  317980.671     0.999829      1315787      5851.43
  319553.535     0.999854      1315821      6826.67
  321388.543     0.999878      1315851      8192.00
  322174.975     0.999890      1315869      9102.22
  323223.551     0.999902      1315886     10240.00
  324272.127     0.999915      1315905     11702.86
  325058.559     0.999927      1315918     13653.33
  325320.703     0.999939      1315931     16384.00
  325844.991     0.999945      1315944     18204.44
  326107.135     0.999951      1315953     20480.00
  326369.279     0.999957      1315958     23405.71
  326893.567     0.999963      1315970     27306.67
  327155.711     0.999969      1315980     32768.00
  327155.711     0.999973      1315980     36408.89
  327155.711     0.999976      1315980     40960.00
  327679.999     0.999979      1315992     46811.43
  327679.999     0.999982      1315992     54613.33
  327679.999     0.999985      1315992     65536.00
  327942.143     0.999986      1315995     72817.78
  327942.143     0.999988      1315995     81920.00
  328204.287     0.999989      1315998     93622.86
  328466.431     0.999991      1316000    109226.67
  328728.575     0.999992      1316004    131072.00
  328728.575     0.999993      1316004    145635.56
  328728.575     0.999994      1316004    163840.00
  328728.575     0.999995      1316004    187245.71
  328990.719     0.999995      1316010    218453.33
  328990.719     0.999996      1316010    262144.00
  328990.719     0.999997      1316010    291271.11
  328990.719     0.999997      1316010    327680.00
  328990.719     0.999997      1316010    374491.43
  328990.719     0.999998      1316010    436906.67
  328990.719     0.999998      1316010    524288.00
  328990.719     0.999998      1316010    582542.22
  328990.719     0.999998      1316010    655360.00
  328990.719     0.999999      1316010    748982.86
  328990.719     0.999999      1316010    873813.33
  328990.719     0.999999      1316010   1048576.00
  328990.719     0.999999      1316010   1165084.44
  328990.719     0.999999      1316010   1310720.00
  329252.863     0.999999      1316011   1497965.71
  329252.863     1.000000      1316011          inf
#[Mean    =   138439.189, StdDeviation   =    75022.254]
#[Max     =   328990.720, Total count    =      1316011]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1335277 requests in 10.00m, 86.59MB read
Requests/sec:   2225.44
Transfer/sec:    147.78KB